
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстПользователю = "Изменилась Цена";

	РассчитатьСумму(ТекущиеДанные, ТекстПользователю);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстПользователю = "Изменилось Количество";
	
	РассчитатьСумму(ТекущиеДанные, ТекстПользователю);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСумму(Строка, Текст)
	Строка.Сумма = Строка.Количество * Строка.Цена;
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = Текст;
	Сообщение.Сообщить();
	
	ОписаниеПользователя = ОписаниеЧеловека();
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ОписаниеПользователя.Имя;
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеЧеловека()

	Человек = Новый Структура;
	Человек.Вставить("Имя", "Антон");
	Человек.Вставить("ДатаРождения", ТекущаяДата());
	Человек.Вставить("Стаж", 15);
	Человек.Вставить("Уволен", Ложь);
	
	Возврат Человек;

КонецФункции

#КонецОбласти









